<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Generator" content="Microsoft Word 97">
   <meta name="GENERATOR" content="Mozilla/4.79 [en] (Windows NT 5.0; U) [Netscape]">
   <meta name="Author" content="Angelika Langer & Klaus Kreft">
   <meta name="KeyWords" content="java">
   <title>Book Review  -  Programming in the .NET Environment</title>
</head>
<body link="#0000FF">
<a NAME="Top"></a><a NAME="BookReviewWatkins"></a>
<p><font color="#295AB5"><font size=+3>Programming in the .NET Environment</font></font>
<br><font color="#295AB5"><font size=+1>Buchbesprechung</font></font>
<br>&nbsp;
<p><font color="#295AB5"><font size=+2>Juli 2003</font></font>
<br><font color="#295AB5"><font size=+1>Klaus Kreft &amp; Angelika Langer</font></font>
<br><img SRC="../../../Images/bar.gif" NOSAVE BORDER=0 height=5 width=600>
<br>&nbsp;
<table BORDER=0 CELLSPACING=0 CELLPADDING=20 >
<tr VALIGN=TOP>
<td><img SRC="imageER3.JPG" height=190 width=151></td>

<td><font face="Arial"><font color="#000099"><font size=-1>Damien Watkins,
Mark Hammond, Brad Abrams</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>"Programming
in the .NET Environment"</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>Addison-WEsley,
November 2002</font></font></font></td>
</tr>
</table>

<h3>
Eine kompetente Darstellung der .NET-Architektur im Kontext moderner Systemplattformen</h3>

<p><br>Microsofts .NET Platform ist noch relativ neu. Folglich gibt es
ein gro&szlig;es Interesse an Information, die dem Software-Ingenieur hilft,
die Hintergr&uuml;nde von .NET zu verstehen und damit zu arbeiten. Programming
in the .NET Environment ist in Addison Wesley's .net Development Series
erschienen und wie die anderen B&uuml;cher aus dieser Serie ein potentieller
Kandidat, um das Interesse an Information zu befriedigen.&nbsp; Deshalb
wollen wir es an dieser Stelle beprechen.
<p>Die drei Autoren sind .NET Experten der ersten Stunde, wobei jeder seinen
spezifischen Hintergrund mitbringt. Damien Watkins ist seit seiner Mitarbeit
bei Project 7 im Jahr 1998 mit .NET besch&auml;ftigt.&nbsp; Von Mark Hammond
stammt die erste Python Implementierung f&uuml;r .NET, die er in den Jahren
von 1999 bis 2001 entwickelt hat. Brad Abrams ist seit 5 Jahren Program
Manager an der Framework Class Libraries Entwicklung bei Microsoft.
<p>Beginnen wir unser Review mit einer kurzen Inhalts&uuml;bersicht. Nach
einem Einleitungskapitel beschreibt das Buch in je einem Kapitel das .NET
Type System, das .NET Metadaten System sowie das .NET Ausf&uuml;hrungssystem.
Nach diesen Grundlagen folgt je ein Kapitel zu den Prinzipien der Applikationserstellung
sowie des Applikationsdeployment unter .NET. Der Hauptteil des Buches schlie&szlig;t
mit einer Diskussion der .NET Framework Class Library sowie ihrer Architekturprinzipien.
Der gesamte Beispielcode des Buchs ist in C#, wobei das Buch kein C#-Tutorial
enth&auml;lt. Es setzt vielmehr voraus, dass der Leser entweder C# bereits
kennt oder aber &uuml;ber ausreichende C++- oder Java-Kenntnisse verf&uuml;gt,
um den Code intuitiv zu verstehen.
<br>Ein relativ umfangreicher Anhang (ca. 1/3 des gesamten Buches) beschreibt
die Integration verschiedener Programmiersprachen (Visual Basic, C#, Python,
Perl, Component Pascal, Scheme (mit Hotdog Compiler), Mondrian und Active
Oberon) in die .NET Umgebung. Dabei ist jeder Programmiersprache ein eigenes
Kapitel gewidmet, das nicht von den drei Buchautoren, sondern von einem
Experten&nbsp; geschrieben ist, der an der Programmiersprachenintegration
beteiligt war. F&uuml;r Python ist dieser Expert nat&uuml;rlich einer der
Buchautoren, n&auml;mlich Mark Hammond.
<p>Die Inhalts&uuml;bersicht l&auml;sst es schon erahnen: im Mittelpunkt
dieses Buches steht die interne .NET Architektur. Ihre Beschreibung erfolgt
mit gro&szlig;er Detailfreude und Sachkenntnis. Es wird zum Beispiel nicht
nur
die heute existierende Architektur beschrieben wird, sondern auch potentielle
Designalternativen und die Gr&uuml;nde f&uuml;r das endg&uuml;ltigen Design.
Dies gilt &uuml;brigens nicht nur f&uuml;r die Information zu .NET selbst,
sondern auch f&uuml;r die im Anhang besprochenen Programmiersprachen. Erfreulich
ist, dass bei der Diskussion der .NET Architekturdetails diese nicht nur
mit COM verglichen werden, sondern auch mit nicht-Microsoft Systemen wie
CORBA und Java. Damit ist die Diskussion der .NET-Systemplattform&nbsp;
eingebettet in einen breiteren Kontext und wendet sich nicht nur an langj&auml;hrige
Microsoft-Benutzer.
<br>&Uuml;berzeugend ist auch die Art und Weise, wie die Information innerhalb
des Buches strukturiert ist. Man wird ausgehend von den absoluten Kernabstraktionen
des Typsystems &uuml;ber Metadaten und Ausf&uuml;hrungssystem zur Entwicklungs-
und Ablaufumgebung der Applikation gef&uuml;hrt. So vervollst&auml;ndigt
sich das Bild, das man von der .NET Architektur bekommt, stetig, ohne allzu
viele Vorw&auml;rtsverweise.
<p>Auf Grund seines Inhalts, wendet sich das Buch im wesentlichen an Leser,
die ein umfassendes Verst&auml;ndnis der .NET Plattform Architektur erlangen
wollen. Es ist nicht besonders f&uuml;r Leser geeignet, die nach m&ouml;glichst
vielen verschiedenen Anwendungsl&ouml;sungen suchen, die sie mit geringen
&Auml;nderungen des Sourcecodes in die eigene Implementierung &uuml;bernehmen
k&ouml;nnen. Das soll aber &uuml;berhaupt nicht hei&szlig;en, dass das
Buch nichts f&uuml;r die Praxis ist. Im Gegenteil. Es ist f&uuml;r Leute,
die auf Grund der Kenntnis der .NET Plattform praktische L&ouml;sungen
bauen wollen. Dabei stellt das Buch noch eine Bedingung an seine potentiellen
Leser: sie d&uuml;rfen keine absoluten Anf&auml;nger sein, was moderne
System-Plattformen angeht. Das Buch beschreibt zwar die .NET Plattformmechanismen
im Detail, aber ein wirkliches Verst&auml;ndnis daf&uuml;r ergibt sich
erst aus der Einordnung dieser Mechanismen im Vergleich zu anderen Plattformen
wie COM, CORBA oder Java.
<p>Gibt es auch Grund zur Kritik am Buch? Ja, zwei kleine Punkte. Zum einen
ist der Titel m&ouml;glicherweise etwas missverst&auml;ndlich. Es geht
in dem Buch weniger um das Programmieren mit der .NET Umgebung als um die
.NET Umgebung selbst. Zum anderen erscheint uns die umfangreiche Diskussion
der Abbildung von verschiedenen, zum Teil recht exotischen Sprachen auf
die .NET Umgebung etwas &uuml;bertrieben. Gegen die Thematik als solche
l&auml;sst sich nichts sagen. Wir haben die Kapitel &uuml;ber Visual Basic
und C# mit Interesse gelesen. Aber Anzahl und Auswahl der anderen Sprachen
erscheint uns nicht unbedingt sehr gl&uuml;cklich. Ob sich viele Leser
f&uuml;r Mondrian und Active Oberon interessieren? Zumal Managed C++ gar
nicht diskutiert wird?
<p>Ingesamt ist Programming in the .NET Environment ein empfehlenswertes
Buch f&uuml;r den erfahrenen Software-Engineur, der sich &uuml;ber die
Zusammenh&auml;nge der .NET-Architektur informieren will. Leider ist es
derzeit nur in der englischen Originalfassung zu bekommen.&nbsp; F&uuml;r
diesen Nachteil wird der Leser aber durch die Kompetenz der Autoren und
die gegl&uuml;ckte Organisation des Buchs entsch&auml;digt.
<br>&nbsp;
<br>&nbsp;
</body>
</html>
