<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Generator" content="Microsoft Word 97">
   <meta name="GENERATOR" content="Mozilla/4.79 [en] (Windows NT 5.0; U) [Netscape]">
   <meta name="Author" content="Angelika Langer & Klaus Kreft">
   <meta name="KeyWords" content="EJB">
   <title>Book Review  -  Enterprise Java Beans</title>
</head>
<body link="#0000FF">
<a NAME="Top"></a><a NAME="BookReviewEJB"></a>
<p><font color="#295AB5"><font size=+3>Enterprise Java Beans</font></font>
<br><font color="#295AB5"><font size=+1>Vergleichendes Buchreview</font></font>
<br>&nbsp;
<p><font color="#295AB5"><font size=+2>JavaSPEKTRUM, September 2002</font></font>
<br><font color="#295AB5"><font size=+1>Klaus Kreft &amp; Angelika Langer</font></font>
<br><img SRC="../../../Images/bar.gif" NOSAVE BORDER=0 height=5 width=600>
<br>&nbsp;
<table BORDER=0 CELLSPACING=0 CELLPADDING=20 COLS=2 >
<tr VALIGN=TOP>
<td><font face="Arial"><font color="#000099"><font size=-1>Ed Roman, Scott
Ambler &amp; Tyler Jewell</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>"Mastering Enterprise
Java Beans", 2<sup>nd</sup> Edition</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>Wiley, 2002</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>ISBN 0-471-41711-4</font></font></font></td>

<td><font face="Arial"><font color="#000099"><font size=-1>Richard Monson-Haefel</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>"Enterprise
Java Beans", 3<sup>rd</sup> Edition</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>O’Reilly, 2001</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>ISBN 1-596-00226-2</font></font></font></td>
</tr>
</table>

<br>&nbsp;
<p><b><font face="Arial"><font size=+2>Abstract</font></font></b>
<p><font size=-1>Wer sich in Enterprise Java Beans (EJB) einarbeiten will
und zu diesem Zwecke ein Buch sucht, dem stehen eine ganze Reihe von Titeln
zu diesem Thema zur Verf&uuml;gung. Im folgenden werden wir zwei dieser
B&uuml;cher besprechen mit dem Ziel, dem wissbegierigen Leser eine Entscheidungshilfe
bei der Literaturauswahl zu geben. Wir haben zwei der popul&auml;rsten
B&uuml;cher zu diesem Thema ausgew&auml;hlt: "Mastering Enterprise Java
Beans" von Ed Roman, et.al. und "Enterprise Java Beans" von Richard Monson-Haefel.</font>
<br>&nbsp;
<br>&nbsp;
<p><b><i><font face="Arial">Enterprise Java Beans (EJB)</font></i></b>
<p><font size=-1>Enterprise Java Beans (EJB) ist ein Standard-Komponentenmodell
f&uuml;r Businessanwendungen, das im Java Community Process entwickelt
und im Jahr 1998 ver&ouml;ffentlicht wurde. Seit der Ver&ouml;ffentlichung
der ersten Version der EJB-Spezifikation in 1998 hat es heftige &Auml;nderungen
und Erweiterungen gegeben. Seit Sommer letzten Jahres liegt die Version
2.0 der EJB-Spezifikation vor und EJB ist f&uuml;r die Java-Community der
de-facto-Standard f&uuml;r die Entwicklung von komponenten-basierten Anwendungen
auf der Serverseite geworden. Sun Microsystems hat eine Referenzimplementierung
von EJB als Bestandteil der Java 2 Enterprise Edition (J2EE) zur Verf&uuml;gung
gestellt und daneben gibt es zahlreiche kommerzielle und Open-Source-Produkte
in diesem Bereich, die in der Industrie bereits seit l&auml;ngerem im Einsatz
sind.</font>
<p><font size=-1>Die oben genannten B&uuml;cher sind in gewissem Sinne
bereits Klassiker. In ihren ersten Ausgaben haben sie EJB 1.0 bzw. 1.1
erl&auml;utert. Die j&uuml;ngsten Ausgaben, die hier besprochen werden,
befassen sich mit der aktuellen Version 2.0 von EJB. Um es gleich vorweg
zu nehmen: beide B&uuml;cher sind gut und ihr Geld wert, aber sie sind
doch recht verschieden, obwohl sie dasselbe Thema behandeln.</font>
<br>&nbsp;
<br>&nbsp;
<p><b><i><font face="Arial">"Mastering Enterprise Java Beans" von Ed Roman,
et.al.</font></i></b>
<p><font size=-1>"Mastering Enterprise Java Beans" n&auml;hert sich dem
Thema EJB auf breiter Front. Das Buch ist u.a. auch f&uuml;r den EBJ-Anf&auml;nger
geschrieben, der sich in EJB einarbeiten will. Es erl&auml;utert aber zus&auml;tzlich
auch anspruchsvollere Aspekte der Anwendung von EJB in der Praxis und beschreibt
dar&uuml;ber hinaus allerlei anderes Wissenswerte im EJB-Umfeld.</font>
<p><font size=-1>Man findet also nicht nur das zu erwartende Tutorial,
das den Leser Schritt f&uuml;r Schritt in alle relevanten Aspekte der Programmierung
mit EJB einf&uuml;hrt (Session Beans, Entity Beans, Message-Driven Beans,
Bean-Managed vs. Container-Managed Persistence, Transactions und Security),
sondern daneben auch Tipps zur erfolgreichen Durchf&uuml;hrung von EJB-Projekten.
Beispielsweise widmet sich ein ganzes Kapitel der Auswahl eines EJB-Servers:
welche Unterscheidungskriterien gibt es und worauf sollte bei der Auswahl
achten. Die Produktauswahl hat nat&uuml;rlich mit der reinen EJB-Programmierung
nicht viel zu tun, ist aber f&uuml;r die konkrete Durchf&uuml;hrung eines
EJB-Projekts durchaus von Bedeutung. So gesehen ist das Kapitel in einem
Buch &uuml;ber EJB durchaus sinnvoll.</font>
<p><font size=-1>Sehr erfreulich sind die Anh&auml;nge des Buchs, die gerade
f&uuml;r Neulinge im EJB-Bereich sehr n&uuml;tzlich sind. Man findet zum
Beispiel einen Anhang, der die Grundz&uuml;ge von Naming und Directory
Services im allgemeinen und das JNDI-Interface im speziellen beschreibt.
Wer mit JNDI bisher nichts zu tun gehabt hat und nun im Zusammenhang mit
EJB erstmalig damit konfrontiert wird, wird dankbar auf diesen Anhang zur&uuml;ckgreifen.
JNDI wird in EJB intensiv benutzt und kommt selbst in trivialen Code-Beispielen
vor. Man braucht wenigstens Grundkenntnisse von JNDI, um die Zusammenh&auml;nge
zu verstehen. Der Anhang &uuml;ber JNDI in dem Buch von Ed Roman liefert
die f&uuml;rs Verst&auml;ndnis notwendigen Einblicke in JNDI, w&auml;hrend
das Buch von Monson-Haefel an dieser Stelle lediglich auf andere B&uuml;cher
verweist.</font>
<p><font size=-1>Ein anderes positives Merkmal von "Mastering Enterprise
Java Beans" sind die Praxis-Tipps. Die Autoren bem&uuml;hen sich, ihre
Erfahrungen aus der praktischen Arbeit mit EJB weiterzugeben. So findet
man ein gesondertes Kapitel zu "EJB Best Practices and Performance Optimizations"
und auch ansonsten sind hier und da Tipps und Tricks eingestreut. Das ist
einerseits sehr n&uuml;tzlich und liefert sinnvolle Denkanst&ouml;&szlig;e,
macht aber andererseits das Buch relativ unruhig, weil st&auml;ndig zwischen
ganz verschiedenen Aspekten hin- und hergesprungen wird.</font>
<p><b><i><font face="Arial">"Enterprise Java Beans" von Richard Monson-Haefel</font></i></b>
<p><font size=-1>Manche EJB-Programmierer betrachten das Buch von Monson-Haefel
als die "EJB-Bibel" schlechthin, vermutlich weil es der erste und f&uuml;r
eine Weile der einzige EJB-Titel war. "Enterprise Java Beans" ist aber
weder besser noch schlechter als "Mastering Enterprise Java Beans"; es
ist lediglich anders.</font>
<p><font size=-1>Man findet auch hier das zu erwartende Tutorial, welches
an einer Beispielapplikation alle Aspekte von EJB diskutiert (Session Beans,
Entity Beans, Message-Driven Beans, Bean-Managed vs. Container-Managed
Persistence, Transactions und Security). Zus&auml;tzlich gibt auch hier
ein Kapitel "Design Strategies", in dem Performance-Optimierungen und diverse
andere sinnvolle Programmiertechniken f&uuml;r EJB dargestellt werden.
Dieses Kapitel &auml;hnelt dem, was "Mastering Enterprise Java Beans" in
seinem Kapitel &uuml;ber "EJB Best Practices and Performance Optimizations"
beschreibt. Das Management von EJB-Projekten, die Auswahl von EJB-Server-Produkten,
und anderen Theme (wie z.B. JNDI) betrachtet Monson-Haefel jedoch nicht.</font>
<br>&nbsp;
<br>&nbsp;
<p><b><i><font face="Arial">Beipiel-Kapitel: Message-Driven Beans</font></i></b>
<p><font size=-1>Zur Illustration der unterschiedlichen Stile sehen wir
uns einmal ein willk&uuml;rlich herausgegriffenes Kapitel n&auml;her an:
das Kapitel &uuml;ber Message-Driven Beans. Die Message-Driven Beans sind
ein Feature, das erst in der letzten Spezifikation von EJB hinzugekommen
ist. Das Kapitel ist also in beiden B&uuml;chern erst in der j&uuml;ngsten
Ausgabe hinzugekommen.</font>
<p><font size=-1>Bis zu EJB 1.1 gab es nur Session- und Entity-Beans; seit
EJB 2.0 gibt es daneben auch noch Message-Driven Beans (MDBs). MDBs sind
zustandslose Komponenten f&uuml;r die Verarbeitung von asynchronen Meldungen:
sie nehmen JMS-Messages an und verarbeiten diese Meldungen. (JMS steht
f&uuml;r Java Message Service und ist das Standard-Java-API f&uuml;r Message-orientierte
Middleware, wie es sie in Form von propriet&auml;ren L&ouml;sungen wie
Progress's SonicMQ schon seit l&auml;ngerem gibt.)</font>
<br>&nbsp;
<br>&nbsp;
<p><font face="Arial">"Enterprise Java Beans" von Richard Monson-Haefel</font>
<p><font size=-1>Monson-Haefel beschreibt zun&auml;chst die Grundz&uuml;ge
von JMS, soweit sie f&uuml;r das Verst&auml;ndnis von Message-Driven Beans
notwendig sind. Man lernt, was die beiden JMS Messaging Domains Topic und
Queue sind und wie die Publish-and-Subcribe und Point-to-Point Messaging
Modelle funktionieren. F&uuml;r weitergehende Information wird auf das
Buch "Java Message Service" von Richard Monson-Haefel und David Chapell
verwiesen. Nach diesem Vorspiel geht es dann um die eigentlichen Message-Driven
Beans, f&uuml;r deren Verwendung sogleich ein Source-Beispiel geliefert
wird, an dem Monson-Haefel alle Aspekte von MDBs erl&auml;utert: den Lebenszyklus
einer MDB, das EnterpriseBean-Interface, das MessageListener Interface,
und auch das Zur&uuml;cksenden einer Antwort an den Absender der verarbeiteten
Message, den Deployment-Deskriptor inklusive Message-Selektoren. Am Ende
des Kapitels wei&szlig; man alles, was man &uuml;ber MDBs wissen muss,
um selber welche implementieren zu k&ouml;nnen.</font>
<p><font face="Arial">"Mastering Enterprise Java Beans" von Ed Roman, et.al.</font>
<p><font size=-1>Bei Ed Roman geht es &auml;hnlich los: &Uuml;berblick
&uuml;ber JMS in etwa demselben Umfang wir bei Monson-Haefel, gefolgt von
einem trivialen Beispiel einer MDB, gefolgt von der Erl&auml;uterung aller
wesentlichen Aspekte von Message-Driven Beans. Die Details der Programmierung
von MDBs sind sehr knapp gehalten in diesem Kapitel; der Autor verweist
bewusst auf das EJB-Tutorial von Sun Microsystems, wo man die Details des
MDB APIs jederzeit studieren k&ouml;nne. Statt die Details in seinem Buch
zu wiederholen, st&uuml;rzt er sich rasch auf die dunklen Seiten von MDBs.
Man liest dann &uuml;ber allerlei Probleme, die man mit MDBs haben kann,
und welche L&ouml;sungsans&auml;tze es daf&uuml;r gibt. Die meisten dieser
Stolpersteine werden auch bei Monson-Haefel erw&auml;hnt, dort aber ohne
l&auml;ngliche Ausf&uuml;hrungen.</font>
<br>&nbsp;
<br>&nbsp;
<p><b><i><font face="Arial">Abschlie&szlig;ender Vergleich</font></i></b>
<p><font size=-1>An diesem Beispielkapitel sieht man deutlich die Unterschiede
im Stil der beiden B&uuml;cher. Bei Ed Roman geht es nicht prim&auml;r
um die Details der Implementierung einer L&ouml;sung, sondern darum, praktische
Probleme mit geeigneten Designans&auml;tzen zu l&ouml;sen. Bei Monson-Haefel
geht es darum, Code zu schreiben und die Konzepte von EJB zu verstehen.
W&auml;hrend sinnvolle L&ouml;sungsans&auml;tze bei Ed Roman von der Design-Sicht
aus erl&auml;utert werden und relativ breit mit Diskussion aller erdenklichen
Alternativen und Vor-und Nachteilen erarbeitet werden, sieht man die L&ouml;sungstechniken
bei Monson-Haefel direkt im Source-Code, ohne l&auml;ngliche Diskussion
von Pro und Contra. Bei Monson-Haefel lernt man: so kann man das machen,
so ist das sinnvoll. Bei Ed Roman lernt man, so - oder aber auch so - k&ouml;nnte
man es machen, und hoppla - da ist noch ein Problem.</font>
<p><font size=-1>Insgesamt ist "Enterprise Java Beans" von Monson-Haefel
wesentlich fokussierter und homogener als "Mastering Enterprise Java Beans"
von Ed Roman, et.al. Monson-Haefel konzentriert sich auf das Implementieren
mit den APIs des EJB-Frameworks und behandelt dieses Thema mit einem erkennbar
h&ouml;heren Detailreichtum. Das soll nicht hei&szlig;en, dass Ed Roman
damit verglichen nur l&uuml;ckenhafte Information bietet; das ist nicht
der Fall. Aber die Details in "Mastering Enterprise Java Beans" beziehen
sich oft auf Design- und Architektur-Aspekte, w&auml;hrend "Enterprise
Java Beans" st&auml;rker auf die Details der EBJ-APIs achtet. Monson-Haefels
Buch spricht vermutlich eher den passionierten Entwickler an, der solche
API-Details nat&uuml;rlich wissen will, w&auml;hrend Ed Romans Buch eher
den Nerv von Architekten, technischen Projektleitern, und Beratern trifft,
die ein starkes Interesse an &Uuml;berblick haben und sich nicht unbedingt
mit allen Details aller Bean-Methoden befassen wollen.</font>
<p><font size=-1>Welches des beiden B&uuml;cher man f&uuml;r die Einarbeitung
in das Thema EJB vorzieht, ist gr&ouml;&szlig;tenteils Geschmacksache.
Beide B&uuml;cher sind vollst&auml;ndig und inhaltlich korrekt (von den
unvermeidbaren Errata abgesehen). Beide sind f&uuml;r das Selbststudium
geeignet. Beide sind &uuml;bersichtlich mit vern&uuml;nftigem Index und
auch als Referenzen gut brauchbar. Man muss sich lediglich entscheiden,
ob man das Thema EJB eher breit oder eher eng umrissen angehen will - oder
ob man im Zweifelsfall vielleicht beide B&uuml;cher lesen will.</font>
<br>&nbsp;
<br>&nbsp;
<p><b><i><font face="Arial">Erg&auml;nzende Informationen zu den B&uuml;chern</font></i></b>
<p><font size=-1>Den Source-Code der Beispiele in den B&uuml;chern kann
man in beiden F&auml;llen kostenlos aus dem Internet herunterladen. Zu
dem Buch von Monson-Haefel gibt es ein Arbeitsbuch f&uuml;r das Selbststudium,
das man ebenfalls als non-printable PDF kostenlos herunterladen oder aber
als Buch bestellen kann. Dieses Arbeitsbuch und den Source-Code gibt es
derzeit in drei Ausf&uuml;hrungen: f&uuml;r JBoss, WebLogic und WebSphere.</font>
<p><font size=-1>Als Erg&auml;nzung zu Ed Romans Buch gibt das Buch "EJB
Design Patterns" von Floyd Marinescu, welches zun&auml;chst als zus&auml;tzliches
Kapitel von "Mastering Enterprise Java Beans" gedacht war, aber dann vom
Unfang her ein eigenes Buch geworden ist. Wer also noch mehr &uuml;ber
Patterns und Programmiertechniken im EJB-Umfeld wissen will, findet hier
weitere Informationen. Die B&uuml;cher von Roman und Marinescu kann man
kostenlos im PDF-Format von der Website der Firma TheServerSide herunterladen.
Die Sache hat allerdings einen kleinen Haken: man muss seine Email-Adresse
hinterlassen und bekommt sp&auml;ter die unvermeidlichen Werbe-Emails der
Firma TheServerSide. Das gleiche gilt f&uuml;r die Code-Beispiele von Ed
Roman's Buch. Auch an anderen Stellen benutzen Ed Roman und seine Ko-Autoren
ihr Buch als Marketing-Vehikel: im Kapitel &uuml;ber das Management von
EJB-Projekten preisen die Autoren unverbl&uuml;mt ihre Dienste als EJB-Berater
an. Ein unsch&ouml;ner Zug an dem sonst so kompetenten und n&uuml;tzlichen
Buch.</font>
<br>&nbsp;
<br>&nbsp;
<p><b><i><font face="Arial">Referenzen</font></i></b>
<p><font face="Arial,Helvetica">EJB-Ressourcen bei SUN Microsystems</font>
<p><font size=-1>Download-Site f&uuml;r J2EE bei SUN: <a href="http://java.sun.com/j2se/1.4/download.html">http://java.sun.com/j2se/1.4/download.html</a></font>
<br><font size=-1>EJB-Tutorial bei SUN: <a href="http://developer.java.sun.com/developer/onlineTraining/Beans/EJBTutorial/index.html">http://developer.java.sun.com/developer/onlineTraining/Beans/EJBTutorial/index.html</a></font>
<br><font size=-1>J2SE-Tutorial bei SUN: <a href="http://java.sun.com/j2ee/tutorial/1_3-fcs/">http://java.sun.com/j2ee/tutorial/1_3-fcs/</a></font>
<br><font size=-1>EJB-Spezifikation bei SUN: <a href="http://java.sun.com/products/ejb/docs.html">http://java.sun.com/products/ejb/docs.html</a></font>
<br>&nbsp;
<br>&nbsp;
<p><font face="Arial">"Mastering Enterprise Java Beans" von Ed Roman, et.al.</font>
<p><font size=-1>Download-Site f&uuml;r von "Mastering Enterprise Java
Beans" von Ed Roman, et.al.: <a href="http://www.theserverside.com/books/masteringEJB/index.jsp">http://www.theserverside.com/books/masteringEJB/index.jsp</a></font>
<br><font size=-1>Download-Site f&uuml;r "EJB Design Patterns" von Floyd
Marinescu: <a href="http://www.theserverside.com/books/EJBDesignPatterns/index.jsp">http://www.theserverside.com/books/EJBDesignPatterns/index.jsp</a></font>
<br><font size=-1>Website von Ed Roman aka TheServerSide: <a href="http://www.theserverside.com/">http://www.theserverside.com/</a></font>
<br>&nbsp;
<br>&nbsp;
<p><font face="Arial">URLs "Enterprise Java Beans" von Richard Monson-Haefel</font>
<p><font size=-1>Download-Site f&uuml;r den Source-Code: <a href="http://www.oreilly.com/catalog/entjbeans2/chapter/examples.html">http://www.oreilly.com/catalog/entjbeans2/chapter/examples.html</a></font>
<br><font size=-1>Website von Richard Monson-Haefel aka jMiddleware: <a href="http://www.jmiddleware.com/">http://www.jmiddleware.com/</a></font>
<p><font size=-1>Leider gibt es Fehler in der Sun Reference Implementation
von J2EE, die es unm&ouml;glich machen, die v&ouml;llig korrekten Beispiele
aus MonsonHaefel's Buch zum Laufen zu kriegen. Es gibt zu diesem Problem
Informationen, die man unbedingt lesen sollte, ehe man versucht, die Beispiele
mir der Sun Reference Implementation von J2EE zum Laufen zu kriegen. Mit
den anderen J2EE-Implementierung (WebLogic, WebSphere und JBoss) gibt es
diese Probleme &uuml;brigens nicht.</font>
<br><font size=-1>Information &uuml;ber die Fehler in der J2EE Reference
Implementation von SUN und die notewendigen Workarounds im Beispiel-Code:
<a href="http://www.ejbnow.com/j2eeri_problems.html">http://www.ejbnow.com/j2eeri_problems.html</a></font>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
</body>
</html>
