<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Generator" content="Microsoft Word 97">
   <meta name="GENERATOR" content="Mozilla/4.79 [en] (Windows NT 5.0; U) [Netscape]">
   <meta name="Author" content="Angelika Langer & Klaus Kreft">
   <meta name="KeyWords" content="java">
   <title>Book Review  -  Head First Java</title>
</head>
<body link="#0000FF">
<a NAME="Top"></a><a NAME="BookReviewHeadFirstJava"></a>
<p><font color="#295AB5"><font size=+3>Java f&uuml;r Anf&auml;nger - einmal
ganz als sonst</font></font>
<br><font color="#295AB5"><font size=+1>Buchbesprechung</font></font>
<br>&nbsp;
<p><font color="#295AB5"><font size=+2>Juli 2003</font></font>
<br><font color="#295AB5"><font size=+1>Klaus Kreft &amp; Angelika Langer</font></font>
<br><img SRC="../../../Images/bar.gif" NOSAVE BORDER=0 height=5 width=600>
<br>&nbsp;
<table BORDER=0 CELLSPACING=0 CELLPADDING=20 COLS=2 >
<tr VALIGN=TOP>
<td><img SRC="imageCVK.JPG" height=140 width=121></td>

<td><font face="Arial"><font color="#000099"><font size=-1>Kathy Sierra
&amp; Bert Bates</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>"Head First
Java"</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>O'Reilly, May
2003</font></font></font></td>
</tr>
</table>

<p>"Head First Java" ist das erste Buch einer neuen Serie des US-Verlags
O'Reilly und versucht, dem Leser einen an sich trockenen Stoff (die Programmiersprache
Java) in v&ouml;llig neuer Art und Weise (nach neuesten Kenntnissen der
Lernpsychologie) zu pr&auml;sentieren.
<p>Der Verlag O'Reilly ist vielen Programmierer wegen seiner guten Fachb&uuml;cher
bekannt ist. Besonders beliebt sind die "Animal Books", in denen ausf&uuml;hrlich
und &auml;u&szlig;erst kompetent relevante Technologien der IT-Branche
beschrieben werden. Aber auch die "... in a Nutshell"-B&uuml;cher, bei
denen es sich um n&uuml;tzliche Nachschlagewerke handelt, sind allgemein
bekannt und gesch&auml;tzt.&nbsp; Mit "Head First Java" startet O'Reilly
eine neue Reihe mit B&uuml;chern zum Selbststudium, in denen versucht wird,
den Inhalt so aufzubereiten, dass er leicht erlernt werden kann.&nbsp;
Dabei flie&szlig;en Erkenntnisse &uuml;ber die Arbeitsweise des menschlichen
Gehirns ein, wie sie in der kognitiven Psychologie bereits seit langem
bekannt sind.&nbsp; Das Buch sieht daher ganz anders aus, als man sich
eine Einf&uuml;hrung in Java vorstellt.
<p>Normalerweise beschr&auml;nken sich Fachb&uuml;cher auf die Darstellung
der Information in Textform mit ein paar eingestreuten Grafiken und Tabellen.&nbsp;
Das ist eher trocken und langweilig.&nbsp; "Head First Java" dagegen sieht
aus wie ein Bilderbuch und wirkt wie die Kladde eines Sch&uuml;lers, der
den Lehrstoff mit reingekritzelten Randbemerkungen verziert hat.&nbsp;
Auf den ersten Blick sieht das Buch v&ouml;llig unseri&ouml;s aus, weil
es so gar nicht den Erwartungen von einem Fachbuch entspricht.
<p>Wenn man sich den Inhalt ansieht, stellt man fest, dass es sich um eine
Einf&uuml;hrung in Java handelt, die durchaus alle relevanten Java-Themen
abdeckt, die man auch sonst in vergleichbaren Java-Einf&uuml;hrungen findet.&nbsp;
Die Behandlung der Themen geht nicht sehr tief und kratzt bisweilen lediglich
an der Oberfl&auml;che.&nbsp; Aber mehr kann man einem Buch, das sich an
Anf&auml;nger wendet, auch nicht erwarten. Daf&uuml;r verwendet es viele
Analogien, um dem Anf&auml;nger die technischen Inhalte zug&auml;nglich
zu machen. Vom Inhalt her ist das Buch v&ouml;llig in Ordnung. Was allerdings
irritiert, ist die Form.&nbsp; Die aber ist so gewollt.
<p>Erkl&auml;rungen in Textform beschr&auml;nken sich auf h&ouml;chstens
einen oder zwei Paragraphen.&nbsp; L&auml;ngere Textpassagen gibt es&nbsp;
&uuml;berhaupt nicht.&nbsp; Daf&uuml;r findet man unz&auml;hlige Bildchen
verziert mit "handschriftlichen" Bemerkungen.&nbsp; Sourcecode taucht ebenfalls
nur in H&auml;ppchen auf, ebenfalls verziert mit Kommentaren.&nbsp; Dazwischen
immer wieder &Uuml;bungen (teilweise als Kreuzwortr&auml;tsel)&nbsp; Dazu
Frage-und-Antwort-Bl&ouml;cke, die wesentliche und wichtige Information
vermitteln und auf keinen Fall &uuml;bersprungen werden sollten. Aber leider
l&auml;dt das Buch sehr zum Springen ein.&nbsp; Schon rein visuell wei&szlig;
man nicht, wo man zuerst hinsehen soll.
<p>Sicher, das Hirn arbeitet nicht linear; Mindmaps sind sehr hilfreich;
ein Bild sagt mehr als tausend Worte; Abwechlsung ist wichtig und die Ann&auml;herung
an ein Thema aus verschiedenen Perspektiven hilft enorm beim Lernen.&nbsp;
Aber sollte man sich nicht vielleicht die Bildchen und Kommentar lieber
selbst erstellen?&nbsp; Wenn das Ergebnis einer Auseinandersetzung mit
einem herk&ouml;mmlichen Java-Lehrbuch so aussieht wie dieses Buch, dann
hat sich der Lernende sicher eifrig mit dem Lehrstoff auseinander gesetzt
und eine Menge Fakten gelernt und in sein Langzeitged&auml;chtnis bef&ouml;rdert.
Aber, ist es wirklich hilfreich, das Ergebnis eines Verarbeitungsprozesses
fertig pr&auml;sentiert zu bekommen statt sich selber um die Verarbeitung
zu bem&uuml;hen?&nbsp; W&auml;re es nicht sinnvoller, die dem Buch zugrunde
liegende Lerntechnik zu erlernen und eine Kladde im Stile von "Head First
Java" selber zu erstellen?
<p>Vermutlich ist es gr&ouml;&szlig;tenteils Geschmacksache, wie man den
Stil von "Head First Java" empfindet.&nbsp; F&uuml;r den an akademische
Texte gew&ouml;hnten Diplom-Informatiker ist das Buch vermutlich eher befremdlich
und irritierend.&nbsp; Als Demonstration einer Lerntechnik ist es sicher
hochinteressant.&nbsp; Und dem einen oder anderen Leser, der vielleicht
schon immer mit diesen langweiligen Fachb&uuml;chern gek&auml;mpft hat,
kommt es in seinem Lernverhalten vielleicht sehr entgegen. Wie auch immer
man das beurteilen wird, "Head First Java" ist eine Einf&uuml;hrung in
Java mit ungew&ouml;hnlichen Mitteln.&nbsp; Und leider derzeit nur in Englisch
erh&auml;ltlich.
<br>&nbsp;
</body>
</html>
