<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Generator" content="Microsoft Word 97">
   <meta name="GENERATOR" content="Mozilla/4.79 [en] (Windows NT 5.0; U) [Netscape]">
   <meta name="Author" content="Angelika Langer & Klaus Kreft">
   <meta name="KeyWords" content="EJB">
   <title>Book Review  -  C++ Templates - The Complete Guide</title>
</head>
<body link="#0000FF">
<a NAME="Top"></a><a NAME="BookReviewVandevoorde"></a>
<p><font color="#295AB5"><font size=+3>C++ Templates - The Complete Guide</font></font>
<br><font color="#295AB5"><font size=+1>Buchreview</font></font>
<br>&nbsp;
<p><font color="#295AB5"><font size=+2>OBJEKTspektrum, M&auml;rz 2003</font></font>
<br><font color="#295AB5"><font size=+1>Klaus Kreft &amp; Angelika Langer</font></font>
<br><img SRC="../../../Images/bar.gif" NOSAVE BORDER=0 height=5 width=600>
<br>&nbsp;
<table BORDER=0 CELLSPACING=0 CELLPADDING=20 >
<tr VALIGN=TOP>
<td><img SRC="image004.jpg" NOSAVE height=140 width=112></td>

<td><font face="Arial"><font color="#000099"><font size=-1>Daveed Vondevoorde
&amp; Nicolai Josuttis</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>"C++ Templates
- The Complete Guide"</font></font></font>
<br><font face="Arial"><font color="#000099"><font size=-1>Addison-Wesley,
2003</font></font></font></td>
</tr>
</table>

<br>&nbsp;
<p>"C++ Templates: The Complete Guide" von David Vandevoorde und Nicolai
Josuttis&nbsp; ist das erste C++-Buch, das sich ausschlie&szlig;lich dem
Thema der C++ Templates widmet.&nbsp; Auf ca. 500 Seiten erf&auml;hrt man
so ziemlich alles, was es derzeit zum Thema Templates zu sagen gibt.
<p>Das Buch zerf&auml;llt in 4 Teile
<ul>
<li>
ein Tutorial, das die Grundlagen der Template-Sprachmittel beschreibt (ca.
80 Seiten),</li>

<li>
einen Teil &uuml;ber die Template-Spachmittel aus Compiler-Sicht, der die
Feinheiten der Sprachmittel beschreibt (ca. 130 Seiten),</li>

<li>
einen Teil &uuml;ber Template-Programmiertechniken (ca. 120 Seiten), und</li>

<li>
einen Teil, der fortgeschrittene Template-Anwendungen zeigt (ca. 130 Seiten).</li>
</ul>

<p><br>Das Tutorial ist sicher der Teil des Buchs, der dem Anf&auml;nger
am meisten bringen wird. Es werden die g&auml;ngigen Template-Sprachmittel
dargestellt mit kurzen Beispielprogrammen.&nbsp; Das Tutorial ist nicht
unbedingt der bemerkenswerteste Teil des Buchs; man findet solche Tutorials
in &auml;hnlicher Form in "normalen" C++-B&uuml;chern wie zum Beispiel
dem Standardwerk&nbsp; "<a href="../StroustrupSpecial/review.htm">The C++
Programming Language</a>" von Bjarne Stroustrup. Aber ohne Einf&uuml;hrung
w&auml;re das Buch unvollst&auml;ndig, weil der Leser ohne Kenntnis von
den Grundlagen der Template-Programmierung den Rest des Buchs nicht verstehen
kann.
<p>Richtig spannend wird es im zweiten Teil.&nbsp; Da geht es um die Details
der Sprachmittel.&nbsp; Die Ausf&uuml;hrungen geben Einblicke in die Arbeitsweise
des Compilers, wie man sie nur selten in B&uuml;chern &uuml;ber Programmiersprachen
findet.&nbsp; (Der einzige Titel, der einem in diesem Zusammenhang in den
Sinn kommt, ist Stan Lippman’s Buch "<a href="../LippmanObjectModel/review.htm">Inside
the C++ Object Model</a>", in dem Details wie der Mechanismus der virtuellen
Funktionen und das Layout von Klassen mit&nbsp; Multiple Inheritance erkl&auml;rt
wird.) Endlich erkl&auml;rt einmal jemand klipp und klar, wie das mit den
Deklarationen von Friends im Zusammenhang mit Templates wirklich geht,
und wie Name-Lookup, Template Argument Deduktion, Template Spezialisierung
und Template Overloading funktionieren.&nbsp; Das ist mit Abstand der beste
Teil des Buchs.&nbsp; Der Template-Kenner findet hier das eine oder andere
Detail, das ihm vielleicht noch nicht hundertprozentig klar war und der
Anf&auml;nger wird sicher sp&auml;ter einmal dankbar auf diesen Teil zur&uuml;ckgreifen,
wenn es gilt , die Details zu verstehen.
<p>Der dritte Teil befa&szlig;t sich mit Template-Programmiertechniken.&nbsp;
Hier findet man in sehr gut aufbereiteter Form die Techniken, die in heute
existierenden Template-Bibliotheken wie STL, Loki, Boost, und Expression
Template Bibliotheken wie Blitz oder PETE verwendet werden.&nbsp; Wer diese
Bibliotheken studiert hat, kennt diese Techniken bereits.&nbsp; Die Ausf&uuml;hrungen
in diesem Buch sind sehr gut, weil sie die Techniken pr&auml;zise auf den
Punkt bringen und sehr klar heraus arbeiten. Dargestellt werden die Prinzipien
des statischen Polymorphismus, Traits- und Policy-Klassen, das Curiously-Recurring-Template-Pattern,
Template-Meta-Programmierung und Expression-Templates. Nach dem Studium
dieser Kapitel hat man die entsprechenden Techniken bereits so weit verstanden,
da&szlig; man sie ohne M&uuml;he auf andere Situationen in der eigenen
praktischen Arbeit anwenden kann.
<p>Im vierten Teil werden Anwendungen der Programmiertechniken gezeigt.&nbsp;
Hier werden Implementierungen von Smart Pointern, Tuples und Funktions-Objekten
besprochen.&nbsp; Ob der Leser diese Beispiele als relevant f&uuml;r seine
praktische Arbeit erachtet, h&auml;ngt sicher von jedem einzelnen Leser
und seinem Aufgabenfeld ab.&nbsp; Beispielsweise wird man wohl kaum einen
Smart Pointer selbst implementieren wollen.&nbsp; Es gibt gen&uuml;gend
frei verf&uuml;gbare Implementierungen in Bibliotheken wie Boost und Loki,
die man ohne Bedenken benutzen kann. (Der <tt>boost::shared_ptr</tt> ist
z.B. bereits f&uuml;r die Aufnahme in die n&auml;chste Version der C+-Standardbibliothek
vorgeschlagen und hat gute Chancen, in ein paar Jahren der Standard-Smart-Pointer
zu sein.) Das mu&szlig; den Leser aber nicht notwendig davon abhalten,
sich die Implementierungstechniken f&uuml;r Smart Pointer genauer anzusehen,
denn man kann daraus eine Menge &uuml;ber Templates lernen.&nbsp; In diesem
Sinne ist dieser letzte Teil des Buchs zwar interessant, aber f&uuml;r
die praktische Arbeit des einen oder anderen Lesers vielleicht nicht unbedingt
so relevant wie die &uuml;brigen Teile des Buch. Wer keine Funktionsobjekttypen
implementiert, wird wenig mit den dargestellten Techniken f&uuml;r die
Function Object Composition oder den Value Bindern anfangen k&ouml;nnen.
Und Template-Metaprogrammierung ist nur in einigen Bereichen der C++-Programmierung
von Bedeutung.
<p>Insgesamt kann man sagen, da&szlig; das Buch gut und empfehlenswert
ist. F&uuml;r den ambitionierten Template-Programmierer mit guten Vorkenntnissen
bez&uuml;glich C++-Templates ist es eine echte Bereicherung.&nbsp; Entwickler,
die jedoch bislang wenig Ber&uuml;hrung mit Templates hatten und fertige
Templates zwar benutzt aber nie selber welche implementiert haben, sollten
darauf gefa&szlig;t sein, da&szlig; das Buch sehr in die Tiefe geht.&nbsp;
Insbesondere bei den hinteren Teilen des Buchs wird man sich anf&auml;nglich
vielleicht zu Recht fragen, was das mit der praktischen Programmierung
in Industrieprojekten zu tun hat. Simple und praktische Anwendungen von
Templates, wie in diesem Artikel dargestellt, vermi&szlig;t man in diesem
Buch. Es wird eigentlich schon voraus gesetzt, da&szlig; man wei&szlig;,
was man mit Templates alles anfangen kann und da&szlig; man sie einsetzen
will.&nbsp; Warum Templates eigentlich Sinn machen und in welchem Kontext
&uuml;berhaupt, wird gar nicht mehr motiviert. Es ist also insgesamt eher
ein Buch f&uuml;r Template-Profis, oder solche, die es werden wollen, und
weniger ein Buch f&uuml;r die vorsichtige Ann&auml;herung an C++-Templates.
<br>&nbsp;
</body>
</html>
